benchmarks/c_oha.txt
Summary:
  Success rate:	99.98%
  Total:	5.1501 secs
  Slowest:	0.4410 secs
  Fastest:	0.0122 secs
  Average:	0.1930 secs
  Requests/sec:	5184.1767

  Total data:	526.93 KiB
  Size/request:	21 B
  Size/sec:	102.31 KiB

Response time histogram:
  0.012 [1]    |
  0.055 [1]    |
  0.098 [73]   |
  0.141 [3953] |■■■■■■■■■■■■■■
  0.184 [8871] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.227 [6741] |■■■■■■■■■■■■■■■■■■■■■■■■
  0.269 [3611] |■■■■■■■■■■■■■
  0.312 [1592] |■■■■■
  0.355 [515]  |■
  0.398 [233]  |
  0.441 [103]  |

Response time distribution:
  10.00% in 0.1324 secs
  25.00% in 0.1526 secs
  50.00% in 0.1834 secs
  75.00% in 0.2224 secs
  90.00% in 0.2676 secs
  95.00% in 0.2916 secs
  99.00% in 0.3707 secs
  99.90% in 0.4196 secs
  99.99% in 0.4365 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0663 secs, 0.0001 secs, 0.2628 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0265 secs

Status code distribution:
  [200] 25694 responses

Error distribution:
  [1000] aborted due to deadline
  [3] operation was canceled
  [1] connection closed before message completed
  [1] connection error