benchmarks/comp_oha.txt
Summary:
  Success rate:	48.28%
  Total:	10.0074 secs
  Slowest:	9.6661 secs
  Fastest:	1.4925 secs
  Average:	5.4754 secs
  Requests/sec:	25.7809

  Total data:	6.15 KiB
  Size/request:	225 B
  Size/sec:	629 B

Response time histogram:
  1.493 [1] |■■■■■■■■
  2.310 [2] |■■■■■■■■■■■■■■■■
  3.127 [2] |■■■■■■■■■■■■■■■■
  3.945 [4] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  4.762 [3] |■■■■■■■■■■■■■■■■■■■■■■■■
  5.579 [3] |■■■■■■■■■■■■■■■■■■■■■■■■
  6.397 [3] |■■■■■■■■■■■■■■■■■■■■■■■■
  7.214 [3] |■■■■■■■■■■■■■■■■■■■■■■■■
  8.031 [1] |■■■■■■■■
  8.849 [3] |■■■■■■■■■■■■■■■■■■■■■■■■
  9.666 [3] |■■■■■■■■■■■■■■■■■■■■■■■■

Response time distribution:
  10.00% in 2.0403 secs
  25.00% in 3.6556 secs
  50.00% in 5.4201 secs
  75.00% in 7.5269 secs
  90.00% in 9.0438 secs
  95.00% in 9.1332 secs
  99.00% in 9.6661 secs
  99.90% in 9.6661 secs
  99.99% in 9.6661 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0719 secs, 0.0450 secs, 0.0881 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0012 secs

Status code distribution:
  [200] 28 responses

Error distribution:
  [200] aborted due to deadline
  [20] connection error
  [10] connection closed before message completed