benchmarks/go_oha.txt
Summary:
  Success rate:	100.00%
  Total:	5.1683 secs
  Slowest:	0.6139 secs
  Fastest:	0.0002 secs
  Average:	0.1026 secs
  Requests/sec:	9561.4808

  Total data:	992.93 KiB
  Size/request:	21 B
  Size/sec:	192.12 KiB

Response time histogram:
  0.000 [1]     |
  0.062 [14816] |■■■■■■■■■■■■■■■■■■■■■■■
  0.123 [20184] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.184 [7897]  |■■■■■■■■■■■■
  0.246 [3032]  |■■■■
  0.307 [1215]  |■
  0.368 [714]   |■
  0.430 [355]   |
  0.491 [145]   |
  0.552 [55]    |
  0.614 [3]     |

Response time distribution:
  10.00% in 0.0298 secs
  25.00% in 0.0544 secs
  50.00% in 0.0855 secs
  75.00% in 0.1301 secs
  90.00% in 0.1923 secs
  95.00% in 0.2476 secs
  99.00% in 0.3768 secs
  99.90% in 0.4969 secs
  99.99% in 0.5493 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0981 secs, 0.0002 secs, 0.1759 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0034 secs

Status code distribution:
  [200] 48417 responses

Error distribution:
  [1000] aborted due to deadline