benchmarks/node_oha.txt
Summary:
  Success rate:	100.00%
  Total:	5.0450 secs
  Slowest:	4.9265 secs
  Fastest:	0.0020 secs
  Average:	0.0494 secs
  Requests/sec:	4780.1634

  Total data:	474.06 KiB
  Size/request:	21 B
  Size/sec:	93.96 KiB

Response time histogram:
  0.002 [1]     |
  0.494 [22966] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.987 [11]    |
  1.479 [15]    |
  1.972 [17]    |
  2.464 [25]    |
  2.957 [23]    |
  3.449 [15]    |
  3.942 [13]    |
  4.434 [16]    |
  4.926 [14]    |

Response time distribution:
  10.00% in 0.0192 secs
  25.00% in 0.0217 secs
  50.00% in 0.0287 secs
  75.00% in 0.0354 secs
  90.00% in 0.0480 secs
  95.00% in 0.0629 secs
  99.00% in 0.1900 secs
  99.90% in 4.1134 secs
  99.99% in 4.8706 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.1110 secs, 0.0005 secs, 0.1747 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200] 23116 responses

Error distribution:
  [1000] aborted due to deadline