benchmarks/py_oha.txt
Summary:
  Success rate:	100.00%
  Total:	5.0310 secs
  Slowest:	4.7492 secs
  Fastest:	0.0017 secs
  Average:	0.0456 secs
  Requests/sec:	1284.4447

  Total data:	112.01 KiB
  Size/request:	21 B
  Size/sec:	22.26 KiB

Response time histogram:
  0.002 [1]    |
  0.476 [5349] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.951 [5]    |
  1.426 [54]   |
  1.901 [9]    |
  2.375 [2]    |
  2.850 [4]    |
  3.325 [27]   |
  3.800 [4]    |
  4.274 [2]    |
  4.749 [5]    |

Response time distribution:
  10.00% in 0.0028 secs
  25.00% in 0.0037 secs
  50.00% in 0.0046 secs
  75.00% in 0.0056 secs
  90.00% in 0.0069 secs
  95.00% in 0.0085 secs
  99.00% in 1.4235 secs
  99.90% in 3.9089 secs
  99.99% in 4.7492 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0331 secs, 0.0001 secs, 3.0535 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs

Status code distribution:
  [200] 5462 responses

Error distribution:
  [1000] aborted due to deadline