benchmarks/wolf_oha.txt
Summary:
  Success rate:	97.83%
  Total:	5.2182 secs
  Slowest:	0.6705 secs
  Fastest:	0.0005 secs
  Average:	0.2252 secs
  Requests/sec:	4210.0346

  Total data:	460.74 KiB
  Size/request:	23 B
  Size/sec:	88.29 KiB

Response time histogram:
  0.001 [1]    |
  0.068 [28]   |
  0.135 [1271] |■■■■
  0.202 [9418] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.269 [5422] |■■■■■■■■■■■■■■■■■■
  0.336 [1867] |■■■■■■
  0.403 [1234] |■■■■
  0.470 [528]  |■
  0.537 [435]  |■
  0.604 [222]  |
  0.671 [87]   |

Response time distribution:
  10.00% in 0.1449 secs
  25.00% in 0.1662 secs
  50.00% in 0.1991 secs
  75.00% in 0.2509 secs
  90.00% in 0.3542 secs
  95.00% in 0.4271 secs
  99.00% in 0.5557 secs
  99.90% in 0.6539 secs
  99.99% in 0.6700 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0776 secs, 0.0001 secs, 0.3589 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0376 secs

Status code distribution:
  [200] 20513 responses

Error distribution:
  [1000] aborted due to deadline
  [442] connection closed before message completed
  [11] operation was canceled
  [3] connection error